rooms = [

    # ===== 실외 =====
    "본관입구",
    "후관입구",
    "별관입구",
    "운동장입구",
    "체육관입구",

    # ===== 1층 =====
    "교장실",
    "본교무실",
    "보건실",

    # ===== 2층 =====
    "1학년 교무실",
    "도서관",
    "김영만실",
    "자율학습실",

    # ===== 3층 =====
    "2학년 교무실",
    "AI실",
    "SW실",
    "WEE클래스",

    # ===== 4층 =====
    "3학년 교무실",
    "음악실",
    "물리실",

    # ===== 계단 =====
    "본관1층계단",
    "본관2층계단",
    "본관3층계단",
    "본관4층계단",

    "후관1층계단",
    "후관2층계단",
    "후관3층계단",
    "후관4층계단",

    "별관1층계단",
    "별관2층계단"
]


positions = {

    # ======================
    # 실외
    # ======================

    "본관입구": {
        "x": 1051,
        "y": 890,
        "building": "실외",
        "floor": 0
    },

    "후관입구": {
        "x": 1163,
        "y": 406,
        "building": "실외",
        "floor": 0
    },

    "별관입구": {
        "x": 527,
        "y": 800,
        "building": "실외",
        "floor": 0
    },

    "운동장입구": {
        "x": 1611,
        "y": 582,
        "building": "실외",
        "floor": 0
    },

    "체육관입구": {
        "x": 1723,
        "y": 1012,
        "building": "실외",
        "floor": 0
    },


    # ======================
    # 1층
    # ======================

    "교장실": {
        "x": 1271,
        "y": 432,
        "building": "본관",
        "floor": 1
    },

    "본교무실": {
        "x": 1409,
        "y": 430,
        "building": "본관",
        "floor": 1
    },

    "보건실": {
        "x": 1000,
        "y": 569,
        "building": "본관",
        "floor": 1
    },


    # ======================
    # 2층
    # ======================

    "1학년 교무실": {
        "x": 990,
        "y": 578,
        "building": "본관",
        "floor": 2
    },

    "도서관": {
        "x": 995,
        "y": 202,
        "building": "후관",
        "floor": 2
    },

    "김영만실": {
        "x": 256,
        "y": 394,
        "building": "별관",
        "floor": 2
    },

    "자율학습실": {
        "x": 460,
        "y": 539,
        "building": "별관",
        "floor": 2
    },


    # ======================
    # 3층
    # ======================

    "2학년 교무실": {
        "x": 1001,
        "y": 582,
        "building": "본관",
        "floor": 3
    },

    "AI실": {
        "x": 943,
        "y": 211,
        "building": "후관",
        "floor": 3
    },

    "SW실": {
        "x": 721,
        "y": 208,
        "building": "후관",
        "floor": 3
    },

    "WEE클래스": {
        "x": 1558,
        "y": 103,
        "building": "후관",
        "floor": 3
    },


    # ======================
    # 4층
    # ======================

    "3학년 교무실": {
        "x": 1005,
        "y": 589,
        "building": "본관",
        "floor": 4
    },

    "음악실": {
        "x": 758,
        "y": 235,
        "building": "후관",
        "floor": 4
    },

    "물리실": {
        "x": 921,
        "y": 245,
        "building": "후관",
        "floor": 4
    },


    # ======================
    # 계단
    # ======================

    "본관1층계단": {
        "x": 959,
        "y": 463,
        "building": "본관",
        "floor": 1
    },

    "본관2층계단": {
        "x": 996,
        "y": 453,
        "building": "본관",
        "floor": 2
    },

    "본관3층계단": {
        "x": 993,
        "y": 453,
        "building": "본관",
        "floor": 3
    },

    "본관4층계단": {
        "x": 994,
        "y": 441,
        "building": "본관",
        "floor": 4
    },

    "후관1층계단": {
        "x": 1097,
        "y": 102,
        "building": "후관",
        "floor": 1
    },

    "후관2층계단": {
        "x": 1117,
        "y": 99,
        "building": "후관",
        "floor": 2
    },

    "후관3층계단": {
        "x": 1121,
        "y": 104,
        "building": "후관",
        "floor": 3
    },

    "후관4층계단": {
        "x": 1091,
        "y": 112,
        "building": "후관",
        "floor": 4
    },

    "별관1층계단": {
        "x": 531,
        "y": 344,
        "building": "별관",
        "floor": 1
    },

    "별관2층계단": {
        "x": 524,
        "y": 384,
        "building": "별관",
        "floor": 2
    }

}