graph = {

    # ======================
    # 본관 입구
    # ======================

    "본관입구": [
        ("교장실", 2),
        ("보건실", 3),
        ("본교무실", 4),
        ("본관1층계단", 2),
        ("후관입구", 15),
        ("별관입구", 12)
    ],

    "교장실": [
        ("본관입구", 2),
        ("본교무실", 1)
    ],

    "본교무실": [
        ("교장실", 1),
        ("본관1층계단", 2)
    ],

    "보건실": [
        ("본관입구", 3),
        ("본관1층계단", 3)
    ],

    # ======================
    # 본관 계단
    # ======================

    "본관1층계단": [
        ("본관입구", 2),
        ("본관2층계단", 8)
    ],

    "본관2층계단": [
        ("본관1층계단", 8),
        ("본관3층계단", 8),
        ("1학년 교무실", 2)
    ],

    "1학년 교무실": [
        ("본관2층계단", 2)
    ],

    "본관3층계단": [
        ("본관2층계단", 8),
        ("본관4층계단", 8),
        ("2학년 교무실", 2)
    ],

    "2학년 교무실": [
        ("본관3층계단", 2)
    ],

    "본관4층계단": [
        ("본관3층계단", 8),
        ("3학년 교무실", 2)
    ],

    "3학년 교무실": [
        ("본관4층계단", 2)
    ],

    # ======================
    # 후관
    # ======================

    "후관입구": [
        ("본관입구", 15),
        ("운동장입구", 12),
        ("후관1층계단", 2)
    ],

    "후관1층계단": [
        ("후관입구", 2),
        ("후관2층계단", 8)
    ],

    "후관2층계단": [
        ("후관1층계단", 8),
        ("후관3층계단", 8),
        ("도서관", 2)
    ],

    "도서관": [
        ("후관2층계단", 2)
    ],

    "후관3층계단": [
        ("후관2층계단", 8),
        ("후관4층계단", 8),
        ("AI실", 2),
        ("SW실", 3),
        ("WEE클래스", 5)
    ],

    "AI실": [
        ("후관3층계단", 2)
    ],

    "SW실": [
        ("후관3층계단", 3)
    ],

    "WEE클래스": [
        ("후관3층계단", 5)
    ],

    "후관4층계단": [
        ("후관3층계단", 8),
        ("음악실", 3),
        ("물리실", 2)
    ],

    "음악실": [
        ("후관4층계단", 3)
    ],

    "물리실": [
        ("후관4층계단", 2)
    ],

    # ======================
    # 별관
    # ======================

    "별관입구": [
        ("본관입구", 12),
        ("별관1층계단", 2)
    ],

    "별관1층계단": [
        ("별관입구", 2),
        ("별관2층계단", 8)
    ],

    "별관2층계단": [
        ("별관1층계단", 8),
        ("김영만실", 2),
        ("자율학습실", 3)
    ],

    "김영만실": [
        ("별관2층계단", 2)
    ],

    "자율학습실": [
        ("별관2층계단", 3)
    ],

    # ======================
    # 운동장
    # ======================

    "운동장입구": [
        ("후관입구", 12),
        ("체육관입구", 5)
    ],

    "체육관입구": [
        ("운동장입구", 5)
    ]
}